Reports/КомплектыВЧастичномПодряде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КомплектыВЧастичномПодряде</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЧастичныйПодряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЧастичныйПодряд</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/КомплектыВЧастичномПодряде/Forms/ФормаОтчета/Ext/Form/Module.bsl
Процедура ОбновитьОтчетНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.ДатаВозврата КАК ДатаВозврата,
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ЧастичныйПодрядСрезПоследних.Комментарий КАК Комментарий,
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик,
		|	ЧастичныйПодрядСрезПоследних.Проект КАК Проект,
		|	ЧастичныйПодрядСрезПоследних.Автор КАК Автор
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Проект = &Проект
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Подрядчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Подрядчик = &Подрядчик
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозврата";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("Подрядчик", 	Подрядчик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.КомплектыВЧастичномПодряде.ПолучитьМакет("Макет");
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Область = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		ПолеВывода.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ПодрядчикПриИзменении(Элемент)
	ОбновитьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодрядчикНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элементы.Подрядчик.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодрядчиков());
КонецПроцедуры

Функция ПолучитьПодрядчиков()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подрядчик");
	
КонецФункции // ПолучитьПодрядчиков()

&НаКлиенте
Процедура ПодрядчикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элементы.Подрядчик.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодрядчиков());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтчетНаСервере();
КонецПроцедуры
